TAGS_METADATA = [
    {
        "name": "Charity Projects",
        "description": "Операции над благотворительными фондами.",
    },
    {
        "name": "Donations",
        "description": "Операции по взносу и просмотру своих пожертвований.",
    },
    {
        "name": "Auth",
        "description": "Регистрация пользователей. Операции входа и выхода.",
    },
    {
        "name": "Users",
        "description": "Операции с пользователями.",
    },
]

NAME_DUPLICATE = "Проект с таким именем уже существует!"
NOT_FOUND_PROJECT = "Проект не найден!"
CLOSE_PROJECT = "Закрытый проект нельзя редактировать!"
INVALID_FULL_AMOUNT = (
    "Невозможно устанавить новую требуемую сумму, так как она меньше уже собранной."
)
INVALID_NAME_OR_FULL_AMOUNT = "Имя или описание не может быть пустой строкой, а требуема сумма не может равняться нулю."
INVALID_DELETE = "В проект были внесены средства, не подлежит удалению!"
NOT_USER_DELETE = "Удаление пользователей запрещено!"
